Revit 2016 API
Face Members
The Face type exposes the following members.
Methods
Name | Description
ComputeDerivatives
Returns the vectors describing the face at the specified point.
ComputeNormal
Returns the normal vector for the face at the given point.
ComputeSecondDerivatives
Returns the second partial derivatives of the face at the specified point.
Dispose
Causes the object to release immediately any resources it may be utilizing.
 (Inherited from APIObject.)
Equals
 Determines whether the specified Object is equal to the current Object.
 (Inherited from GeometryObject.)
Evaluate
Evaluates parameters on the face.
GetBoundingBox
Returns the UV bounding box of the face.
GetEdgesAsCurveLoops
Returns a list of closed curve loops that correspond to the edge loops of the face. Curves in each curve loop correspond to individual edges.
GetHashCode
 Gets the integer value of the geometry object as hash code
 (Inherited from GeometryObject.)
GetRegions
Face regions (created with the Split Face command) of the face.
GetType
Gets the Type of the current instance.
 (Inherited from Object.)
Intersect(Curve)
Calculates the intersection of the specified curve with this face.
Intersect(Face)
Calculates the intersection of the specified face with this face and returns the intersection results.
Intersect(Curve, IntersectionResultArray)
Calculates the intersection of the specified curve with this face and returns the intersection results.
Intersect(Face, Curve)
Calculates the intersection of the specified face with this face and returns the intersection results.
IsInside(UV)
Indicates whether the specified point is within this face.
IsInside(UV, IntersectionResult)
Indicates whether the specified point is within this face and outputs additional results.
Project
Projects the specified point on this face.
ToString
Returns a string that represents the current object.
 (Inherited from Object.)
Triangulate()
Returns a triangular mesh approximation to the face.
Triangulate(Double)
Returns a triangular mesh approximation to the face.
Properties
Name | Description
Area
The area of this face.
EdgeLoops
Each edge loop is a closed boundary of the face.
GraphicsStyleId
The ElementId of the GeometryObject's GraphicsStyle
 (Inherited from GeometryObject.)
HasRegions
Reports if the face contains regions created with the Split Face command.
IsCyclic
The boolean value that indicates whether this face is periodic in the specified parametric direction.
IsElementGeometry
Indicates whether this geometry is obtained directly from an Element.
 (Inherited from GeometryObject.)
IsReadOnly
Identifies if the object is read-only or modifiable.
 (Inherited from APIObject.)
IsTwoSided
Determines if a face is two-sided (degenerate)
MaterialElementId
Element ID of the material from which this face is composed.
Period
The period of this face in the specified parametric direction.
Reference
Returns a stable reference to the face.
Visibility
The visibility.
 (Inherited from GeometryObject.)
See Also
Face Class
Autodesk.Revit.DB Namespace